espressif/esp-idf/components/soc/esp32h21/register/soc/pmu_reg.h
/** PMU_POWER_FLASH1P8_LDO_REG register
 *  need_des
 */
#define PMU_POWER_FLASH1P8_LDO_REG (DR_REG_PMU_BASE + 0x11c)
/** PMU_FLASH1P8_LDO_RDY : RO; bitpos: [0]; default: 1;
 *  need_des
 */
#define PMU_FLASH1P8_LDO_RDY    (BIT(0))
#define PMU_FLASH1P8_LDO_RDY_M  (PMU_FLASH1P8_LDO_RDY_V << PMU_FLASH1P8_LDO_RDY_S)
#define PMU_FLASH1P8_LDO_RDY_V  0x00000001U
#define PMU_FLASH1P8_LDO_RDY_S  0
/** PMU_FLASH1P8_SW_EN_XPD : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P8_SW_EN_XPD    (BIT(1))
#define PMU_FLASH1P8_SW_EN_XPD_M  (PMU_FLASH1P8_SW_EN_XPD_V << PMU_FLASH1P8_SW_EN_XPD_S)
#define PMU_FLASH1P8_SW_EN_XPD_V  0x00000001U
#define PMU_FLASH1P8_SW_EN_XPD_S  1
/** PMU_FLASH1P8_SW_EN_THRU : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P8_SW_EN_THRU    (BIT(2))
#define PMU_FLASH1P8_SW_EN_THRU_M  (PMU_FLASH1P8_SW_EN_THRU_V << PMU_FLASH1P8_SW_EN_THRU_S)
#define PMU_FLASH1P8_SW_EN_THRU_V  0x00000001U
#define PMU_FLASH1P8_SW_EN_THRU_S  2
/** PMU_FLASH1P8_SW_EN_STANDBY : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P8_SW_EN_STANDBY    (BIT(3))
#define PMU_FLASH1P8_SW_EN_STANDBY_M  (PMU_FLASH1P8_SW_EN_STANDBY_V << PMU_FLASH1P8_SW_EN_STANDBY_S)
#define PMU_FLASH1P8_SW_EN_STANDBY_V  0x00000001U
#define PMU_FLASH1P8_SW_EN_STANDBY_S  3
/** PMU_FLASH1P8_SW_EN_POWER_ADJUST : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P8_SW_EN_POWER_ADJUST    (BIT(4))
#define PMU_FLASH1P8_SW_EN_POWER_ADJUST_M  (PMU_FLASH1P8_SW_EN_POWER_ADJUST_V << PMU_FLASH1P8_SW_EN_POWER_ADJUST_S)
#define PMU_FLASH1P8_SW_EN_POWER_ADJUST_V  0x00000001U
#define PMU_FLASH1P8_SW_EN_POWER_ADJUST_S  4
/** PMU_FLASH1P8_SW_EN_ENDET : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P8_SW_EN_ENDET    (BIT(5))
#define PMU_FLASH1P8_SW_EN_ENDET_M  (PMU_FLASH1P8_SW_EN_ENDET_V << PMU_FLASH1P8_SW_EN_ENDET_S)
#define PMU_FLASH1P8_SW_EN_ENDET_V  0x00000001U
#define PMU_FLASH1P8_SW_EN_ENDET_S  5
/** PMU_FLASH1P8_BYPASS_LDO_RDY : R/W; bitpos: [22]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P8_BYPASS_LDO_RDY    (BIT(22))
#define PMU_FLASH1P8_BYPASS_LDO_RDY_M  (PMU_FLASH1P8_BYPASS_LDO_RDY_V << PMU_FLASH1P8_BYPASS_LDO_RDY_S)
#define PMU_FLASH1P8_BYPASS_LDO_RDY_V  0x00000001U
#define PMU_FLASH1P8_BYPASS_LDO_RDY_S  22
/** PMU_FLASH1P8_XPD : R/W; bitpos: [23]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P8_XPD    (BIT(23))
#define PMU_FLASH1P8_XPD_M  (PMU_FLASH1P8_XPD_V << PMU_FLASH1P8_XPD_S)
#define PMU_FLASH1P8_XPD_V  0x00000001U
#define PMU_FLASH1P8_XPD_S  23
/** PMU_FLASH1P8_THRU : R/W; bitpos: [24]; default: 1;
 *  need_des
 */
#define PMU_FLASH1P8_THRU    (BIT(24))
#define PMU_FLASH1P8_THRU_M  (PMU_FLASH1P8_THRU_V << PMU_FLASH1P8_THRU_S)
#define PMU_FLASH1P8_THRU_V  0x00000001U
#define PMU_FLASH1P8_THRU_S  24
/** PMU_FLASH1P8_STANDBY : R/W; bitpos: [25]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P8_STANDBY    (BIT(25))
#define PMU_FLASH1P8_STANDBY_M  (PMU_FLASH1P8_STANDBY_V << PMU_FLASH1P8_STANDBY_S)
#define PMU_FLASH1P8_STANDBY_V  0x00000001U
#define PMU_FLASH1P8_STANDBY_S  25
/** PMU_FLASH1P8_POWER_ADJUST : R/W; bitpos: [29:26]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P8_POWER_ADJUST    0x0000000FU
#define PMU_FLASH1P8_POWER_ADJUST_M  (PMU_FLASH1P8_POWER_ADJUST_V << PMU_FLASH1P8_POWER_ADJUST_S)
#define PMU_FLASH1P8_POWER_ADJUST_V  0x0000000FU
#define PMU_FLASH1P8_POWER_ADJUST_S  26
/** PMU_FLASH1P8_ENDET : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P8_ENDET    (BIT(31))
#define PMU_FLASH1P8_ENDET_M  (PMU_FLASH1P8_ENDET_V << PMU_FLASH1P8_ENDET_S)
#define PMU_FLASH1P8_ENDET_V  0x00000001U
#define PMU_FLASH1P8_ENDET_S  31

/** PMU_POWER_FLASH1P2_LDO_REG register
 *  need_des
 */
#define PMU_POWER_FLASH1P2_LDO_REG (DR_REG_PMU_BASE + 0x120)
/** PMU_FLASH1P2_LDO_RDY : RO; bitpos: [0]; default: 1;
 *  need_des
 */
#define PMU_FLASH1P2_LDO_RDY    (BIT(0))
#define PMU_FLASH1P2_LDO_RDY_M  (PMU_FLASH1P2_LDO_RDY_V << PMU_FLASH1P2_LDO_RDY_S)
#define PMU_FLASH1P2_LDO_RDY_V  0x00000001U
#define PMU_FLASH1P2_LDO_RDY_S  0
/** PMU_FLASH1P2_SW_EN_XPD : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P2_SW_EN_XPD    (BIT(1))
#define PMU_FLASH1P2_SW_EN_XPD_M  (PMU_FLASH1P2_SW_EN_XPD_V << PMU_FLASH1P2_SW_EN_XPD_S)
#define PMU_FLASH1P2_SW_EN_XPD_V  0x00000001U
#define PMU_FLASH1P2_SW_EN_XPD_S  1
/** PMU_FLASH1P2_SW_EN_THRU : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P2_SW_EN_THRU    (BIT(2))
#define PMU_FLASH1P2_SW_EN_THRU_M  (PMU_FLASH1P2_SW_EN_THRU_V << PMU_FLASH1P2_SW_EN_THRU_S)
#define PMU_FLASH1P2_SW_EN_THRU_V  0x00000001U
#define PMU_FLASH1P2_SW_EN_THRU_S  2
/** PMU_FLASH1P2_SW_EN_STANDBY : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P2_SW_EN_STANDBY    (BIT(3))
#define PMU_FLASH1P2_SW_EN_STANDBY_M  (PMU_FLASH1P2_SW_EN_STANDBY_V << PMU_FLASH1P2_SW_EN_STANDBY_S)
#define PMU_FLASH1P2_SW_EN_STANDBY_V  0x00000001U
#define PMU_FLASH1P2_SW_EN_STANDBY_S  3
/** PMU_FLASH1P2_SW_EN_POWER_ADJUST : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P2_SW_EN_POWER_ADJUST    (BIT(4))
#define PMU_FLASH1P2_SW_EN_POWER_ADJUST_M  (PMU_FLASH1P2_SW_EN_POWER_ADJUST_V << PMU_FLASH1P2_SW_EN_POWER_ADJUST_S)
#define PMU_FLASH1P2_SW_EN_POWER_ADJUST_V  0x00000001U
#define PMU_FLASH1P2_SW_EN_POWER_ADJUST_S  4
/** PMU_FLASH1P2_SW_EN_ENDET : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P2_SW_EN_ENDET    (BIT(5))
#define PMU_FLASH1P2_SW_EN_ENDET_M  (PMU_FLASH1P2_SW_EN_ENDET_V << PMU_FLASH1P2_SW_EN_ENDET_S)
#define PMU_FLASH1P2_SW_EN_ENDET_V  0x00000001U
#define PMU_FLASH1P2_SW_EN_ENDET_S  5
/** PMU_FLASH1P2_BYPASS_LDO_RDY : R/W; bitpos: [22]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P2_BYPASS_LDO_RDY    (BIT(22))
#define PMU_FLASH1P2_BYPASS_LDO_RDY_M  (PMU_FLASH1P2_BYPASS_LDO_RDY_V << PMU_FLASH1P2_BYPASS_LDO_RDY_S)
#define PMU_FLASH1P2_BYPASS_LDO_RDY_V  0x00000001U
#define PMU_FLASH1P2_BYPASS_LDO_RDY_S  22
/** PMU_FLASH1P2_XPD : R/W; bitpos: [23]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P2_XPD    (BIT(23))
#define PMU_FLASH1P2_XPD_M  (PMU_FLASH1P2_XPD_V << PMU_FLASH1P2_XPD_S)
#define PMU_FLASH1P2_XPD_V  0x00000001U
#define PMU_FLASH1P2_XPD_S  23
/** PMU_FLASH1P2_THRU : R/W; bitpos: [24]; default: 1;
 *  need_des
 */
#define PMU_FLASH1P2_THRU    (BIT(24))
#define PMU_FLASH1P2_THRU_M  (PMU_FLASH1P2_THRU_V << PMU_FLASH1P2_THRU_S)
#define PMU_FLASH1P2_THRU_V  0x00000001U
#define PMU_FLASH1P2_THRU_S  24
/** PMU_FLASH1P2_STANDBY : R/W; bitpos: [25]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P2_STANDBY    (BIT(25))
#define PMU_FLASH1P2_STANDBY_M  (PMU_FLASH1P2_STANDBY_V << PMU_FLASH1P2_STANDBY_S)
#define PMU_FLASH1P2_STANDBY_V  0x00000001U
#define PMU_FLASH1P2_STANDBY_S  25
/** PMU_FLASH1P2_POWER_ADJUST : R/W; bitpos: [29:26]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P2_POWER_ADJUST    0x0000000FU
#define PMU_FLASH1P2_POWER_ADJUST_M  (PMU_FLASH1P2_POWER_ADJUST_V << PMU_FLASH1P2_POWER_ADJUST_S)
#define PMU_FLASH1P2_POWER_ADJUST_V  0x0000000FU
#define PMU_FLASH1P2_POWER_ADJUST_S  26
/** PMU_FLASH1P2_ENDET : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_FLASH1P2_ENDET    (BIT(31))
#define PMU_FLASH1P2_ENDET_M  (PMU_FLASH1P2_ENDET_V << PMU_FLASH1P2_ENDET_S)
#define PMU_FLASH1P2_ENDET_V  0x00000001U
#define PMU_FLASH1P2_ENDET_S  31

/** PMU_POWER_VDD_FLASH_REG register
 *  need_des
 */
#define PMU_POWER_VDD_FLASH_REG (DR_REG_PMU_BASE + 0x124)
/** PMU_FLASH_LDO_SW_EN_TIEL : R/W; bitpos: [22]; default: 0;
 *  need_des
 */
#define PMU_FLASH_LDO_SW_EN_TIEL    (BIT(22))
#define PMU_FLASH_LDO_SW_EN_TIEL_M  (PMU_FLASH_LDO_SW_EN_TIEL_V << PMU_FLASH_LDO_SW_EN_TIEL_S)
#define PMU_FLASH_LDO_SW_EN_TIEL_V  0x00000001U
#define PMU_FLASH_LDO_SW_EN_TIEL_S  22
/** PMU_FLASH_LDO_POWER_SEL : R/W; bitpos: [23]; default: 0;
 *  need_des
 */
#define PMU_FLASH_LDO_POWER_SEL    (BIT(23))
#define PMU_FLASH_LDO_POWER_SEL_M  (PMU_FLASH_LDO_POWER_SEL_V << PMU_FLASH_LDO_POWER_SEL_S)
#define PMU_FLASH_LDO_POWER_SEL_V  0x00000001U
#define PMU_FLASH_LDO_POWER_SEL_S  23
/** PMU_FLASH_LDO_SW_EN_POWER_SEL : R/W; bitpos: [24]; default: 0;
 *  need_des
 */
#define PMU_FLASH_LDO_SW_EN_POWER_SEL    (BIT(24))
#define PMU_FLASH_LDO_SW_EN_POWER_SEL_M  (PMU_FLASH_LDO_SW_EN_POWER_SEL_V << PMU_FLASH_LDO_SW_EN_POWER_SEL_S)
#define PMU_FLASH_LDO_SW_EN_POWER_SEL_V  0x00000001U
#define PMU_FLASH_LDO_SW_EN_POWER_SEL_S  24
/** PMU_FLASH_LDO_WAIT_TARGET : R/W; bitpos: [28:25]; default: 15;
 *  need_des
 */
#define PMU_FLASH_LDO_WAIT_TARGET    0x0000000FU
#define PMU_FLASH_LDO_WAIT_TARGET_M  (PMU_FLASH_LDO_WAIT_TARGET_V << PMU_FLASH_LDO_WAIT_TARGET_S)
#define PMU_FLASH_LDO_WAIT_TARGET_V  0x0000000FU
#define PMU_FLASH_LDO_WAIT_TARGET_S  25
/** PMU_FLASH_LDO_TIEL_EN : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_FLASH_LDO_TIEL_EN    (BIT(29))
#define PMU_FLASH_LDO_TIEL_EN_M  (PMU_FLASH_LDO_TIEL_EN_V << PMU_FLASH_LDO_TIEL_EN_S)
#define PMU_FLASH_LDO_TIEL_EN_V  0x00000001U
#define PMU_FLASH_LDO_TIEL_EN_S  29
/** PMU_FLASH_LDO_TIEL : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_FLASH_LDO_TIEL    (BIT(30))
#define PMU_FLASH_LDO_TIEL_M  (PMU_FLASH_LDO_TIEL_V << PMU_FLASH_LDO_TIEL_S)
#define PMU_FLASH_LDO_TIEL_V  0x00000001U
#define PMU_FLASH_LDO_TIEL_S  30
/** PMU_FLASH_LDO_SW_UPDATE : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_FLASH_LDO_SW_UPDATE    (BIT(31))
#define PMU_FLASH_LDO_SW_UPDATE_M  (PMU_FLASH_LDO_SW_UPDATE_V << PMU_FLASH_LDO_SW_UPDATE_S)
#define PMU_FLASH_LDO_SW_UPDATE_V  0x00000001U
#define PMU_FLASH_LDO_SW_UPDATE_S  31

/** PMU_POWER_IO_LDO_REG register
 *  need_des
 */
#define PMU_POWER_IO_LDO_REG (DR_REG_PMU_BASE + 0x128)
/** PMU_IO_LDO_RDY : RO; bitpos: [0]; default: 1;
 *  need_des
 */
#define PMU_IO_LDO_RDY    (BIT(0))
#define PMU_IO_LDO_RDY_M  (PMU_IO_LDO_RDY_V << PMU_IO_LDO_RDY_S)
#define PMU_IO_LDO_RDY_V  0x00000001U
#define PMU_IO_LDO_RDY_S  0
/** PMU_IO_SW_EN_XPD : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_IO_SW_EN_XPD    (BIT(1))
#define PMU_IO_SW_EN_XPD_M  (PMU_IO_SW_EN_XPD_V << PMU_IO_SW_EN_XPD_S)
#define PMU_IO_SW_EN_XPD_V  0x00000001U
#define PMU_IO_SW_EN_XPD_S  1
/** PMU_IO_SW_EN_THRU : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define PMU_IO_SW_EN_THRU    (BIT(3))
#define PMU_IO_SW_EN_THRU_M  (PMU_IO_SW_EN_THRU_V << PMU_IO_SW_EN_THRU_S)
#define PMU_IO_SW_EN_THRU_V  0x00000001U
#define PMU_IO_SW_EN_THRU_S  3
/** PMU_IO_SW_EN_STANDBY : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define PMU_IO_SW_EN_STANDBY    (BIT(4))
#define PMU_IO_SW_EN_STANDBY_M  (PMU_IO_SW_EN_STANDBY_V << PMU_IO_SW_EN_STANDBY_S)
#define PMU_IO_SW_EN_STANDBY_V  0x00000001U
#define PMU_IO_SW_EN_STANDBY_S  4
/** PMU_IO_SW_EN_POWER_ADJUST : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define PMU_IO_SW_EN_POWER_ADJUST    (BIT(5))
#define PMU_IO_SW_EN_POWER_ADJUST_M  (PMU_IO_SW_EN_POWER_ADJUST_V << PMU_IO_SW_EN_POWER_ADJUST_S)
#define PMU_IO_SW_EN_POWER_ADJUST_V  0x00000001U
#define PMU_IO_SW_EN_POWER_ADJUST_S  5
/** PMU_IO_SW_EN_ENDET : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define PMU_IO_SW_EN_ENDET    (BIT(6))
#define PMU_IO_SW_EN_ENDET_M  (PMU_IO_SW_EN_ENDET_V << PMU_IO_SW_EN_ENDET_S)
#define PMU_IO_SW_EN_ENDET_V  0x00000001U
#define PMU_IO_SW_EN_ENDET_S  6
/** PMU_IO_BYPASS_LDO_RDY : R/W; bitpos: [22]; default: 0;
 *  need_des
 */
#define PMU_IO_BYPASS_LDO_RDY    (BIT(22))
#define PMU_IO_BYPASS_LDO_RDY_M  (PMU_IO_BYPASS_LDO_RDY_V << PMU_IO_BYPASS_LDO_RDY_S)
#define PMU_IO_BYPASS_LDO_RDY_V  0x00000001U
#define PMU_IO_BYPASS_LDO_RDY_S  22
/** PMU_IO_XPD : R/W; bitpos: [23]; default: 0;
 *  need_des
 */
#define PMU_IO_XPD    (BIT(23))
#define PMU_IO_XPD_M  (PMU_IO_XPD_V << PMU_IO_XPD_S)
#define PMU_IO_XPD_V  0x00000001U
#define PMU_IO_XPD_S  23
/** PMU_IO_THRU : R/W; bitpos: [24]; default: 1;
 *  need_des
 */
#define PMU_IO_THRU    (BIT(24))
#define PMU_IO_THRU_M  (PMU_IO_THRU_V << PMU_IO_THRU_S)
#define PMU_IO_THRU_V  0x00000001U
#define PMU_IO_THRU_S  24
/** PMU_IO_STANDBY : R/W; bitpos: [25]; default: 0;
 *  need_des
 */
#define PMU_IO_STANDBY    (BIT(25))
#define PMU_IO_STANDBY_M  (PMU_IO_STANDBY_V << PMU_IO_STANDBY_S)
#define PMU_IO_STANDBY_V  0x00000001U
#define PMU_IO_STANDBY_S  25
/** PMU_IO_POWER_ADJUST : R/W; bitpos: [29:26]; default: 0;
 *  need_des
 */
#define PMU_IO_POWER_ADJUST    0x0000000FU
#define PMU_IO_POWER_ADJUST_M  (PMU_IO_POWER_ADJUST_V << PMU_IO_POWER_ADJUST_S)
#define PMU_IO_POWER_ADJUST_V  0x0000000FU
#define PMU_IO_POWER_ADJUST_S  26
/** PMU_IO_ENDET : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_IO_ENDET    (BIT(31))
#define PMU_IO_ENDET_M  (PMU_IO_ENDET_V << PMU_IO_ENDET_S)
#define PMU_IO_ENDET_V  0x00000001U
#define PMU_IO_ENDET_S  31

