espressif/esp-idf/components/soc/esp32h21/register/soc/pmu_reg.h
/** PMU_LP_CPU_PWR0_REG register
 *  need_des
 */
#define PMU_LP_CPU_PWR0_REG (DR_REG_PMU_BASE + 0x194)
/** PMU_LP_CPU_WAITI_RDY : RO; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_WAITI_RDY    (BIT(0))
#define PMU_LP_CPU_WAITI_RDY_M  (PMU_LP_CPU_WAITI_RDY_V << PMU_LP_CPU_WAITI_RDY_S)
#define PMU_LP_CPU_WAITI_RDY_V  0x00000001U
#define PMU_LP_CPU_WAITI_RDY_S  0
/** PMU_LP_CPU_STALL_RDY : RO; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_STALL_RDY    (BIT(1))
#define PMU_LP_CPU_STALL_RDY_M  (PMU_LP_CPU_STALL_RDY_V << PMU_LP_CPU_STALL_RDY_S)
#define PMU_LP_CPU_STALL_RDY_V  0x00000001U
#define PMU_LP_CPU_STALL_RDY_S  1
/** PMU_LP_CPU_FORCE_STALL : R/W; bitpos: [18]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_FORCE_STALL    (BIT(18))
#define PMU_LP_CPU_FORCE_STALL_M  (PMU_LP_CPU_FORCE_STALL_V << PMU_LP_CPU_FORCE_STALL_S)
#define PMU_LP_CPU_FORCE_STALL_V  0x00000001U
#define PMU_LP_CPU_FORCE_STALL_S  18
/** PMU_LP_CPU_SLP_WAITI_FLAG_EN : R/W; bitpos: [19]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_SLP_WAITI_FLAG_EN    (BIT(19))
#define PMU_LP_CPU_SLP_WAITI_FLAG_EN_M  (PMU_LP_CPU_SLP_WAITI_FLAG_EN_V << PMU_LP_CPU_SLP_WAITI_FLAG_EN_S)
#define PMU_LP_CPU_SLP_WAITI_FLAG_EN_V  0x00000001U
#define PMU_LP_CPU_SLP_WAITI_FLAG_EN_S  19
/** PMU_LP_CPU_SLP_STALL_FLAG_EN : R/W; bitpos: [20]; default: 1;
 *  need_des
 */
#define PMU_LP_CPU_SLP_STALL_FLAG_EN    (BIT(20))
#define PMU_LP_CPU_SLP_STALL_FLAG_EN_M  (PMU_LP_CPU_SLP_STALL_FLAG_EN_V << PMU_LP_CPU_SLP_STALL_FLAG_EN_S)
#define PMU_LP_CPU_SLP_STALL_FLAG_EN_V  0x00000001U
#define PMU_LP_CPU_SLP_STALL_FLAG_EN_S  20
/** PMU_LP_CPU_SLP_STALL_WAIT : R/W; bitpos: [28:21]; default: 255;
 *  need_des
 */
#define PMU_LP_CPU_SLP_STALL_WAIT    0x000000FFU
#define PMU_LP_CPU_SLP_STALL_WAIT_M  (PMU_LP_CPU_SLP_STALL_WAIT_V << PMU_LP_CPU_SLP_STALL_WAIT_S)
#define PMU_LP_CPU_SLP_STALL_WAIT_V  0x000000FFU
#define PMU_LP_CPU_SLP_STALL_WAIT_S  21
/** PMU_LP_CPU_SLP_STALL_EN : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_SLP_STALL_EN    (BIT(29))
#define PMU_LP_CPU_SLP_STALL_EN_M  (PMU_LP_CPU_SLP_STALL_EN_V << PMU_LP_CPU_SLP_STALL_EN_S)
#define PMU_LP_CPU_SLP_STALL_EN_V  0x00000001U
#define PMU_LP_CPU_SLP_STALL_EN_S  29
/** PMU_LP_CPU_SLP_RESET_EN : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_SLP_RESET_EN    (BIT(30))
#define PMU_LP_CPU_SLP_RESET_EN_M  (PMU_LP_CPU_SLP_RESET_EN_V << PMU_LP_CPU_SLP_RESET_EN_S)
#define PMU_LP_CPU_SLP_RESET_EN_V  0x00000001U
#define PMU_LP_CPU_SLP_RESET_EN_S  30
/** PMU_LP_CPU_SLP_BYPASS_INTR_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_SLP_BYPASS_INTR_EN    (BIT(31))
#define PMU_LP_CPU_SLP_BYPASS_INTR_EN_M  (PMU_LP_CPU_SLP_BYPASS_INTR_EN_V << PMU_LP_CPU_SLP_BYPASS_INTR_EN_S)
#define PMU_LP_CPU_SLP_BYPASS_INTR_EN_V  0x00000001U
#define PMU_LP_CPU_SLP_BYPASS_INTR_EN_S  31

/** PMU_LP_CPU_PWR1_REG register
 *  need_des
 */
#define PMU_LP_CPU_PWR1_REG (DR_REG_PMU_BASE + 0x198)
/** PMU_LP_CPU_WAKEUP_EN : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_WAKEUP_EN    0x0000FFFFU
#define PMU_LP_CPU_WAKEUP_EN_M  (PMU_LP_CPU_WAKEUP_EN_V << PMU_LP_CPU_WAKEUP_EN_S)
#define PMU_LP_CPU_WAKEUP_EN_V  0x0000FFFFU
#define PMU_LP_CPU_WAKEUP_EN_S  0
/** PMU_LP_CPU_SLEEP_REQ : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_SLEEP_REQ    (BIT(31))
#define PMU_LP_CPU_SLEEP_REQ_M  (PMU_LP_CPU_SLEEP_REQ_V << PMU_LP_CPU_SLEEP_REQ_S)
#define PMU_LP_CPU_SLEEP_REQ_V  0x00000001U
#define PMU_LP_CPU_SLEEP_REQ_S  31

/** PMU_HP_LP_CPU_COMM_REG register
 *  need_des
 */
#define PMU_HP_LP_CPU_COMM_REG (DR_REG_PMU_BASE + 0x19c)
/** PMU_LP_TRIGGER_HP : WT; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_LP_TRIGGER_HP    (BIT(30))
#define PMU_LP_TRIGGER_HP_M  (PMU_LP_TRIGGER_HP_V << PMU_LP_TRIGGER_HP_S)
#define PMU_LP_TRIGGER_HP_V  0x00000001U
#define PMU_LP_TRIGGER_HP_S  30
/** PMU_HP_TRIGGER_LP : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_HP_TRIGGER_LP    (BIT(31))
#define PMU_HP_TRIGGER_LP_M  (PMU_HP_TRIGGER_LP_V << PMU_HP_TRIGGER_LP_S)
#define PMU_HP_TRIGGER_LP_V  0x00000001U
#define PMU_HP_TRIGGER_LP_S  31

/** PMU_HP_REGULATOR_CFG_REG register
 *  need_des
 */
#define PMU_HP_REGULATOR_CFG_REG (DR_REG_PMU_BASE + 0x1a0)
/** PMU_DIG_REGULATOR_EN_CAL : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_DIG_REGULATOR_EN_CAL    (BIT(31))
#define PMU_DIG_REGULATOR_EN_CAL_M  (PMU_DIG_REGULATOR_EN_CAL_V << PMU_DIG_REGULATOR_EN_CAL_S)
#define PMU_DIG_REGULATOR_EN_CAL_V  0x00000001U
#define PMU_DIG_REGULATOR_EN_CAL_S  31

/** PMU_MAIN_STATE_REG register
 *  need_des
 */
#define PMU_MAIN_STATE_REG (DR_REG_PMU_BASE + 0x1a4)
/** PMU_MAIN_LAST_ST_STATE : RO; bitpos: [17:11]; default: 256;
 *  need_des
 */
#define PMU_MAIN_LAST_ST_STATE    0x0000007FU
#define PMU_MAIN_LAST_ST_STATE_M  (PMU_MAIN_LAST_ST_STATE_V << PMU_MAIN_LAST_ST_STATE_S)
#define PMU_MAIN_LAST_ST_STATE_V  0x0000007FU
#define PMU_MAIN_LAST_ST_STATE_S  11
/** PMU_MAIN_TAR_ST_STATE : RO; bitpos: [24:18]; default: 4;
 *  need_des
 */
#define PMU_MAIN_TAR_ST_STATE    0x0000007FU
#define PMU_MAIN_TAR_ST_STATE_M  (PMU_MAIN_TAR_ST_STATE_V << PMU_MAIN_TAR_ST_STATE_S)
#define PMU_MAIN_TAR_ST_STATE_V  0x0000007FU
#define PMU_MAIN_TAR_ST_STATE_S  18
/** PMU_MAIN_CUR_ST_STATE : RO; bitpos: [31:25]; default: 1;
 *  need_des
 */
#define PMU_MAIN_CUR_ST_STATE    0x0000007FU
#define PMU_MAIN_CUR_ST_STATE_M  (PMU_MAIN_CUR_ST_STATE_V << PMU_MAIN_CUR_ST_STATE_S)
#define PMU_MAIN_CUR_ST_STATE_V  0x0000007FU
#define PMU_MAIN_CUR_ST_STATE_S  25

/** PMU_PWR_STATE_REG register
 *  need_des
 */
#define PMU_PWR_STATE_REG (DR_REG_PMU_BASE + 0x1a8)
/** PMU_BACKUP_ST_STATE : RO; bitpos: [17:13]; default: 1;
 *  need_des
 */
#define PMU_BACKUP_ST_STATE    0x0000001FU
#define PMU_BACKUP_ST_STATE_M  (PMU_BACKUP_ST_STATE_V << PMU_BACKUP_ST_STATE_S)
#define PMU_BACKUP_ST_STATE_V  0x0000001FU
#define PMU_BACKUP_ST_STATE_S  13
/** PMU_LP_PWR_ST_STATE : RO; bitpos: [22:18]; default: 0;
 *  need_des
 */
#define PMU_LP_PWR_ST_STATE    0x0000001FU
#define PMU_LP_PWR_ST_STATE_M  (PMU_LP_PWR_ST_STATE_V << PMU_LP_PWR_ST_STATE_S)
#define PMU_LP_PWR_ST_STATE_V  0x0000001FU
#define PMU_LP_PWR_ST_STATE_S  18
/** PMU_HP_PWR_ST_STATE : RO; bitpos: [31:23]; default: 1;
 *  need_des
 */
#define PMU_HP_PWR_ST_STATE    0x000001FFU
#define PMU_HP_PWR_ST_STATE_M  (PMU_HP_PWR_ST_STATE_V << PMU_HP_PWR_ST_STATE_S)
#define PMU_HP_PWR_ST_STATE_V  0x000001FFU
#define PMU_HP_PWR_ST_STATE_S  23

/** PMU_CLK_STATE0_REG register
 *  need_des
 */
#define PMU_CLK_STATE0_REG (DR_REG_PMU_BASE + 0x1ac)
/** PMU_STABLE_XPD_BBPLL_STATE : RO; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_STABLE_XPD_BBPLL_STATE    (BIT(0))
#define PMU_STABLE_XPD_BBPLL_STATE_M  (PMU_STABLE_XPD_BBPLL_STATE_V << PMU_STABLE_XPD_BBPLL_STATE_S)
#define PMU_STABLE_XPD_BBPLL_STATE_V  0x00000001U
#define PMU_STABLE_XPD_BBPLL_STATE_S  0
/** PMU_STABLE_XPD_XTAL_STATE : RO; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_STABLE_XPD_XTAL_STATE    (BIT(1))
#define PMU_STABLE_XPD_XTAL_STATE_M  (PMU_STABLE_XPD_XTAL_STATE_V << PMU_STABLE_XPD_XTAL_STATE_S)
#define PMU_STABLE_XPD_XTAL_STATE_V  0x00000001U
#define PMU_STABLE_XPD_XTAL_STATE_S  1
/** PMU_SYS_CLK_SLP_SEL_STATE : RO; bitpos: [15]; default: 0;
 *  need_des
 */
#define PMU_SYS_CLK_SLP_SEL_STATE    (BIT(15))
#define PMU_SYS_CLK_SLP_SEL_STATE_M  (PMU_SYS_CLK_SLP_SEL_STATE_V << PMU_SYS_CLK_SLP_SEL_STATE_S)
#define PMU_SYS_CLK_SLP_SEL_STATE_V  0x00000001U
#define PMU_SYS_CLK_SLP_SEL_STATE_S  15
/** PMU_SYS_CLK_SEL_STATE : RO; bitpos: [17:16]; default: 0;
 *  need_des
 */
#define PMU_SYS_CLK_SEL_STATE    0x00000003U
#define PMU_SYS_CLK_SEL_STATE_M  (PMU_SYS_CLK_SEL_STATE_V << PMU_SYS_CLK_SEL_STATE_S)
#define PMU_SYS_CLK_SEL_STATE_V  0x00000003U
#define PMU_SYS_CLK_SEL_STATE_S  16
/** PMU_SYS_CLK_NO_DIV_STATE : RO; bitpos: [18]; default: 0;
 *  need_des
 */
#define PMU_SYS_CLK_NO_DIV_STATE    (BIT(18))
#define PMU_SYS_CLK_NO_DIV_STATE_M  (PMU_SYS_CLK_NO_DIV_STATE_V << PMU_SYS_CLK_NO_DIV_STATE_S)
#define PMU_SYS_CLK_NO_DIV_STATE_V  0x00000001U
#define PMU_SYS_CLK_NO_DIV_STATE_S  18
/** PMU_ICG_SYS_CLK_EN_STATE : RO; bitpos: [19]; default: 1;
 *  need_des
 */
#define PMU_ICG_SYS_CLK_EN_STATE    (BIT(19))
#define PMU_ICG_SYS_CLK_EN_STATE_M  (PMU_ICG_SYS_CLK_EN_STATE_V << PMU_ICG_SYS_CLK_EN_STATE_S)
#define PMU_ICG_SYS_CLK_EN_STATE_V  0x00000001U
#define PMU_ICG_SYS_CLK_EN_STATE_S  19
/** PMU_ICG_MODEM_SWITCH_STATE : RO; bitpos: [20]; default: 0;
 *  need_des
 */
#define PMU_ICG_MODEM_SWITCH_STATE    (BIT(20))
#define PMU_ICG_MODEM_SWITCH_STATE_M  (PMU_ICG_MODEM_SWITCH_STATE_V << PMU_ICG_MODEM_SWITCH_STATE_S)
#define PMU_ICG_MODEM_SWITCH_STATE_V  0x00000001U
#define PMU_ICG_MODEM_SWITCH_STATE_S  20
/** PMU_ICG_MODEM_CODE_STATE : RO; bitpos: [22:21]; default: 0;
 *  need_des
 */
#define PMU_ICG_MODEM_CODE_STATE    0x00000003U
#define PMU_ICG_MODEM_CODE_STATE_M  (PMU_ICG_MODEM_CODE_STATE_V << PMU_ICG_MODEM_CODE_STATE_S)
#define PMU_ICG_MODEM_CODE_STATE_V  0x00000003U
#define PMU_ICG_MODEM_CODE_STATE_S  21
/** PMU_ICG_SLP_SEL_STATE : RO; bitpos: [23]; default: 0;
 *  need_des
 */
#define PMU_ICG_SLP_SEL_STATE    (BIT(23))
#define PMU_ICG_SLP_SEL_STATE_M  (PMU_ICG_SLP_SEL_STATE_V << PMU_ICG_SLP_SEL_STATE_S)
#define PMU_ICG_SLP_SEL_STATE_V  0x00000001U
#define PMU_ICG_SLP_SEL_STATE_S  23
/** PMU_ICG_GLOBAL_XTAL_STATE : RO; bitpos: [24]; default: 0;
 *  need_des
 */
#define PMU_ICG_GLOBAL_XTAL_STATE    (BIT(24))
#define PMU_ICG_GLOBAL_XTAL_STATE_M  (PMU_ICG_GLOBAL_XTAL_STATE_V << PMU_ICG_GLOBAL_XTAL_STATE_S)
#define PMU_ICG_GLOBAL_XTAL_STATE_V  0x00000001U
#define PMU_ICG_GLOBAL_XTAL_STATE_S  24
/** PMU_ICG_GLOBAL_PLL_STATE : RO; bitpos: [25]; default: 0;
 *  need_des
 */
#define PMU_ICG_GLOBAL_PLL_STATE    (BIT(25))
#define PMU_ICG_GLOBAL_PLL_STATE_M  (PMU_ICG_GLOBAL_PLL_STATE_V << PMU_ICG_GLOBAL_PLL_STATE_S)
#define PMU_ICG_GLOBAL_PLL_STATE_V  0x00000001U
#define PMU_ICG_GLOBAL_PLL_STATE_S  25
/** PMU_ANA_I2C_ISO_EN_STATE : RO; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_ANA_I2C_ISO_EN_STATE    (BIT(26))
#define PMU_ANA_I2C_ISO_EN_STATE_M  (PMU_ANA_I2C_ISO_EN_STATE_V << PMU_ANA_I2C_ISO_EN_STATE_S)
#define PMU_ANA_I2C_ISO_EN_STATE_V  0x00000001U
#define PMU_ANA_I2C_ISO_EN_STATE_S  26
/** PMU_ANA_I2C_RETENTION_STATE : RO; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_ANA_I2C_RETENTION_STATE    (BIT(27))
#define PMU_ANA_I2C_RETENTION_STATE_M  (PMU_ANA_I2C_RETENTION_STATE_V << PMU_ANA_I2C_RETENTION_STATE_S)
#define PMU_ANA_I2C_RETENTION_STATE_V  0x00000001U
#define PMU_ANA_I2C_RETENTION_STATE_S  27
/** PMU_ANA_XPD_BB_I2C_STATE : RO; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_ANA_XPD_BB_I2C_STATE    (BIT(28))
#define PMU_ANA_XPD_BB_I2C_STATE_M  (PMU_ANA_XPD_BB_I2C_STATE_V << PMU_ANA_XPD_BB_I2C_STATE_S)
#define PMU_ANA_XPD_BB_I2C_STATE_V  0x00000001U
#define PMU_ANA_XPD_BB_I2C_STATE_S  28
/** PMU_ANA_XPD_BBPLL_I2C_STATE : RO; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_ANA_XPD_BBPLL_I2C_STATE    (BIT(29))
#define PMU_ANA_XPD_BBPLL_I2C_STATE_M  (PMU_ANA_XPD_BBPLL_I2C_STATE_V << PMU_ANA_XPD_BBPLL_I2C_STATE_S)
#define PMU_ANA_XPD_BBPLL_I2C_STATE_V  0x00000001U
#define PMU_ANA_XPD_BBPLL_I2C_STATE_S  29
/** PMU_ANA_XPD_BBPLL_STATE : RO; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_ANA_XPD_BBPLL_STATE    (BIT(30))
#define PMU_ANA_XPD_BBPLL_STATE_M  (PMU_ANA_XPD_BBPLL_STATE_V << PMU_ANA_XPD_BBPLL_STATE_S)
#define PMU_ANA_XPD_BBPLL_STATE_V  0x00000001U
#define PMU_ANA_XPD_BBPLL_STATE_S  30
/** PMU_ANA_XPD_XTAL_STATE : RO; bitpos: [31]; default: 1;
 *  need_des
 */
#define PMU_ANA_XPD_XTAL_STATE    (BIT(31))
#define PMU_ANA_XPD_XTAL_STATE_M  (PMU_ANA_XPD_XTAL_STATE_V << PMU_ANA_XPD_XTAL_STATE_S)
#define PMU_ANA_XPD_XTAL_STATE_V  0x00000001U
#define PMU_ANA_XPD_XTAL_STATE_S  31

/** PMU_CLK_STATE1_REG register
 *  need_des
 */
#define PMU_CLK_STATE1_REG (DR_REG_PMU_BASE + 0x1b0)
/** PMU_ICG_FUNC_EN_STATE : RO; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define PMU_ICG_FUNC_EN_STATE    0xFFFFFFFFU
#define PMU_ICG_FUNC_EN_STATE_M  (PMU_ICG_FUNC_EN_STATE_V << PMU_ICG_FUNC_EN_STATE_S)
#define PMU_ICG_FUNC_EN_STATE_V  0xFFFFFFFFU
#define PMU_ICG_FUNC_EN_STATE_S  0

